tutorials/combustion/fireFoam/les/smallPoolFire2D/0/p
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    outlet
    {
        type            calculated;
        value           $internalField;
    }

    sides
    {
        type            calculated;
        value           $internalField;
    }
    base
    {
        type            calculated;
        value           $internalField;
    }
    inlet
    {
        type            calculated;
        value           $internalField;
    }
    frontBack
    {
        type            empty;
    }
}


// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
